espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/throughput/throughput.c
/***************************************************************************//**
 * @file
 * @brief Routines for the Throughput plugin, which provides a mechanism for
 *        measuring network throughput.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include <stdint.h>
#include "app/framework/include/af.h"
#include "app/framework/util/af-main.h"
#include "math.h"
#include "app/framework/plugin/counters/counters.h"
#ifdef UNIX_HOST
#include <time.h>
#endif // UNIX_HOST
#define MAX_PACKET_LENGTH 127
#define MAX_ZIGBEE_TX_TEST_MESSAGE_LENGTH   80
#define ZIGBEE_TX_TEST_MAX_INFLIGHT         5

typedef struct {
  bool inUse;
  uint32_t startTime;
  uint8_t seqn;
} InflightInfo;

static struct {
  EmberApsOption apsOptions;
  EmberNodeId destination;
  uint8_t payloadLength;
  uint8_t headerLength;
  uint8_t packetLength;
  uint16_t messageTotalCount;
  uint16_t messageRunningCount;
  uint16_t messageSuccessCount;
  uint8_t maxInFlight;
  uint8_t currentInFlight;
  uint16_t txIntervalMs;
  uint32_t startTime;
  uint32_t runTime;
  uint32_t testTimeout;
  uint32_t minSendTimeMs;
  uint32_t maxSendTimeMs;
  uint32_t sumSendTimeMs;
  uint32_t varSendTimeMs;
  InflightInfo inflightInfoTable[ZIGBEE_TX_TEST_MAX_INFLIGHT];
} testParams;

#ifndef UC_BUILD
// CLI-runnable functions
void emAfPluginThroughputCliSetAllParameters(void);
void emAfPluginThroughputCliStartTest(void);
void emAfPluginThroughputCliStopTest(void);
void emAfPluginThroughputCliSetDestination(void);
void emAfPluginThroughputCliSetInterval(void);
void emAfPluginThroughputCliSetTestTimeout(void);
void emAfPluginThroughputCliSetTestCount(void);
void emAfPluginThroughputCliSetInFlightCount(void);
void emAfPluginThroughputCliSetPacketSize(void);
void emAfPluginThroughputCliSetApsAckOff(void);
void emAfPluginThroughputCliSetApsAckOn(void);
void emAfPluginThroughputCliPrintParameters(void);
void emAfPluginThroughputCliPrintResult(void);
void emAfPluginThroughputCliPrintCounters(void);
void emAfPluginThroughputCliClearCounters(void);
#else
#include "sl_cli.h"
#endif
//stack events and handlers
#ifdef UC_BUILD
sl_zigbee_event_t emberAfPluginThroughputPacketSendEvent;
#define throughputPacketSendEventControl (&emberAfPluginThroughputPacketSendEvent)
void emberAfPluginThroughputPacketSendEventHandler(SLXU_UC_EVENT);
#else
EmberEventControl emberAfPluginThroughputPacketSendEventControl;
#define throughputPacketSendEventControl emberAfPluginThroughputPacketSendEventControl
void emberAfPluginThroughputPacketSendEventHandler(void);
#endif

//Other declarations
static uint8_t isRunning = 0;
extern uint16_t emberCounters[EMBER_COUNTER_TYPE_COUNT];
extern const char * titleStrings[];
static void getHeaderLen(void);
static void printParameter(uint8_t printSelection);
static void printCounter(uint8_t);
static void printAllParameters(void);
static void printResult(void);
static void startTest(void);
static void stopTest(void);
static void clearCounters(void);
enum printSelection {
  DESTINATION = 0,
  COUNT,
  INTERVAL,
  HEADER,
  PAYLOAD,
  PACKET,
  INFLIGHT,
  APSOPTIONS,
  TESTTIMEOUT
};

//---internal callback

void emAfPluginThroughputInitCallback(SLXU_INIT_ARG)
{
  SLXU_INIT_UNUSED_ARG;

  slxu_zigbee_event_init(throughputPacketSendEventControl,
                         emberAfPluginThroughputPacketSendEventHandler);
}

//-------------------------------------------------

static void printParameter(uint8_t printSelection)
{
  switch (printSelection) {
    case DESTINATION:
      emberAfCorePrintln("Destination nodeID: 0x%2x ", testParams.destination);
      break;
    case COUNT:
      emberAfCorePrintln("Packets to send: %d ", testParams.messageTotalCount);
      break;
    case INTERVAL:
      emberAfCorePrintln("Transmit interval: %d ms", testParams.txIntervalMs);
      break;
    case HEADER:
      emberAfCorePrintln("Header size: %dB", testParams.headerLength);
      break;
    case PAYLOAD:
      emberAfCorePrintln("Payload size: %dB", testParams.payloadLength);
      break;
    case PACKET:
      emberAfCorePrintln("Packet size: %dB", testParams.packetLength);
      break;
    case INFLIGHT:
      emberAfCorePrintln("Packets in flight: %d", testParams.maxInFlight);
      break;
    case APSOPTIONS:
      emberAfCorePrintln("APS Options = 0x%2x", testParams.apsOptions);
      break;
    case TESTTIMEOUT:
      emberAfCorePrintln("Timeout: %d ms", testParams.testTimeout);
      break;
    default:
      emberAfCorePrintln("Err");
  }
}

static void printAllParameters(void)
{
  emberAfCorePrintln(" ");
  emberAfCorePrintln("TEST PARAMETERS");
  printParameter(DESTINATION);
  printParameter(COUNT);
  printParameter(INTERVAL);
  printParameter(PAYLOAD);
  printParameter(PACKET);
  printParameter(INFLIGHT);
  printParameter(APSOPTIONS);
  printParameter(TESTTIMEOUT);
}

static void printResult(void)
{
  uint32_t mean, var, std;

  if (isRunning) {
    emberAfCorePrintln("Test still in progress");
    testParams.runTime = elapsedTimeInt32u(testParams.startTime, halCommonGetInt32uMillisecondTick());
  }
  uint64_t appThroughput = (testParams.messageSuccessCount
                            * testParams.payloadLength);
  appThroughput = appThroughput * 8 * 1000 / testParams.runTime;

  uint64_t phyThroughput = (testParams.messageSuccessCount
                            * testParams.packetLength);
  phyThroughput = phyThroughput * 8 * 1000 / testParams.runTime;

  emberAfCorePrintln(" ");
  emberAfCorePrintln("THROUGHPUT RESULTS");
  emberAfCorePrintln("Total time %u ms", testParams.runTime);
  emberAfCorePrintln("Success messages: %d out of %d",
                     testParams.messageSuccessCount,
                     testParams.messageTotalCount);
  emberAfCorePrintln("Payload Throughput: %u bits/s", appThroughput);
  emberAfCorePrintln("Phy Throughput: %u bits/s", phyThroughput);
  if (testParams.messageSuccessCount > 0) {
    mean = testParams.sumSendTimeMs / testParams.messageSuccessCount;
    //10X scaling factor makes large number less likely to overflow
    var = testParams.varSendTimeMs * 10 / testParams.messageSuccessCount;
    if (var > (mean * mean) ) {
      var -= (mean * mean);
      std = sqrt(fabs(var));
    } else {
      std = 0;
    }

