espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/throughput/throughput.c
    emberAfCorePrintln("Min packet send time: %u ms",
                       testParams.minSendTimeMs);
    emberAfCorePrintln("Max packet send time: %u ms",
                       testParams.maxSendTimeMs);
    emberAfCorePrintln("Avg packet send time: %u ms", mean);
    emberAfCorePrintln("STD packet send time: %u ms", std);
  }
}

static void startTest(void)
{
  uint8_t i;

  if (isRunning) {
    emberAfCorePrintln("Test already in progress");
    return;
  }

  if (testParams.packetLength <= 50) {
    emberAfCorePrintln("Err: Invalid Packet Size");
    printAllParameters();
    return;
  }

  if (testParams.messageTotalCount == 0) {
    emberAfCorePrintln("Err: Invalid Count");
    printAllParameters();
    return;
  }

  isRunning = 1;
  testParams.currentInFlight = 0;
  testParams.messageRunningCount = 0;
  testParams.messageSuccessCount = 0;
  testParams.startTime = halCommonGetInt32uMillisecondTick();
  testParams.runTime = 0;
  testParams.minSendTimeMs = 0xFFFFFFFF;
  testParams.maxSendTimeMs = 0;
  testParams.sumSendTimeMs = 0;
  testParams.varSendTimeMs = 0;
  for (i = 0; i < ZIGBEE_TX_TEST_MAX_INFLIGHT; i++) {
    testParams.inflightInfoTable[i].inUse = false;
  }
  clearCounters();
  emberAfCorePrintln("Starting Test");
#ifdef UC_BUILD
  emberAfPluginThroughputPacketSendEventHandler(throughputPacketSendEventControl);
#else
  emberAfPluginThroughputPacketSendEventHandler();
#endif
}

static void stopTest(void)
{
  slxu_zigbee_event_set_inactive(throughputPacketSendEventControl);
  testParams.messageTotalCount = 0;
  isRunning = 0;
  emberAfCorePrintln("Test Aborted");
}

static void clearCounters(void)
{
  emberAfCorePrintln("Clearing counters");
  emberAfPluginCountersClear();
}

static bool messageSentHandler(EmberOutgoingMessageType type,
                               uint16_t indexOrDestination,
                               EmberApsFrame* apsFrame,
                               uint16_t msgLen,
                               uint8_t* message,
                               EmberStatus status)
{
  (void)type;
  (void)indexOrDestination;
  (void)msgLen;
  (void)message;

  // Is this is a message sent out as part of the throughput test?
  if (apsFrame->profileId == 0x7F01 && apsFrame->clusterId == 0x0001) {
    uint32_t packetSendTimeMs = 0xFFFFFFFF;
    uint8_t i;

    testParams.currentInFlight--;

    for (i = 0; i < ZIGBEE_TX_TEST_MAX_INFLIGHT; i++) {
      if (testParams.inflightInfoTable[i].seqn == apsFrame->sequence) {
        testParams.inflightInfoTable[i].inUse = false;
        packetSendTimeMs = elapsedTimeInt32u(testParams.inflightInfoTable[i].startTime, halCommonGetInt32uMillisecondTick());
        break;
      }
    }

    assert(packetSendTimeMs != 0xFFFFFFFF);

    if (status == EMBER_SUCCESS) {
      testParams.messageSuccessCount++;
      testParams.sumSendTimeMs += packetSendTimeMs;

      if (testParams.minSendTimeMs > packetSendTimeMs) {
        testParams.minSendTimeMs = packetSendTimeMs;
      }
      if (testParams.maxSendTimeMs < packetSendTimeMs) {
        testParams.maxSendTimeMs = packetSendTimeMs;
      }

      //10X scaling factor makes large number less likely to overflow
      testParams.varSendTimeMs += packetSendTimeMs * packetSendTimeMs / 10;
    }

    if (testParams.currentInFlight == 0
        && testParams.messageRunningCount
        == testParams.messageTotalCount) {
      emberAfCorePrintln("Test Complete");
      testParams.runTime = elapsedTimeInt32u(testParams.startTime, halCommonGetInt32uMillisecondTick());
      printResult();
    }
    return true;
  }
  return false;
}

#ifdef UC_BUILD
#ifdef EZSP_HOST
void emAfPluginThroughputMessageSentCallback(EmberOutgoingMessageType type,
                                             uint16_t indexOrDestination,
                                             EmberApsFrame *apsFrame,
                                             uint8_t messageTag,
                                             EmberStatus status,
                                             uint8_t messageLength,
                                             uint8_t *messageContents)
{
  messageSentHandler(type,
                     indexOrDestination,
                     apsFrame,
                     messageLength,
                     messageContents,
                     status);
}
#else // SoC
void emAfPluginThroughputMessageSentCallback(EmberIncomingMessageType type,
                                             uint16_t indexOrDestination,
                                             EmberApsFrame *apsFrame,
                                             EmberMessageBuffer messageBuf,
                                             EmberStatus status)
{
  messageSentHandler(type,
                     indexOrDestination,
                     apsFrame,
                     emGetBufferLength(messageBuf),
                     emGetBufferPointer(messageBuf),
                     status);
}
#endif // EZSP_HOST
#else // !UC_BUILD
bool emberAfMessageSentCallback(EmberOutgoingMessageType type,
                                uint16_t indexOrDestination,
                                EmberApsFrame* apsFrame,
                                uint16_t msgLen,
                                uint8_t* message,
                                EmberStatus status)
{
  return messageSentHandler(type,
                            indexOrDestination,
                            apsFrame,
                            msgLen,
                            message,
                            status);
}
#endif // UC_BUILD

static void getHeaderLen(void)
{
  EmberApsFrame* testFrame;
  testFrame = emberAfGetCommandApsFrame();
  uint8_t maxPayloadLen = emberAfMaximumApsPayloadLength(
    EMBER_OUTGOING_DIRECT,
    testParams.destination,
    testFrame) - EMBER_AF_ZCL_MANUFACTURER_SPECIFIC_OVERHEAD;
  testParams.headerLength = MAX_PACKET_LENGTH - maxPayloadLen;
}

static void printCounter(uint8_t id)
{
  emberAfCorePrintln("%p: %u ", titleStrings[id], emberCounters[id]);
}
void emberAfPluginThroughputPacketSendEventHandler(SLXU_UC_EVENT)
{
  EmberApsFrame apsFrame;
  uint8_t messagePayload[MAX_ZIGBEE_TX_TEST_MESSAGE_LENGTH];
  uint16_t messageTag[1] = { 0 };
  uint8_t i;
  uint32_t txIntervalAdjustmentMs;
  uint32_t adjustedTxIntervalMs;

