espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/throughput/throughput.c
  uint32_t currentTimeMs = halCommonGetInt32uMillisecondTick();
  uint32_t totalRunTimeMs = elapsedTimeInt32u(testParams.startTime, currentTimeMs);
  if ((totalRunTimeMs >= testParams.testTimeout)
      && (testParams.testTimeout > 0)) {
    emberAfCorePrintln("Timeout Exceeded");
    stopTest();
    return;
  }
  messagePayload[0] = testParams.payloadLength;
  messagePayload[1] = LOW_BYTE(testParams.messageRunningCount);
  messagePayload[2] = HIGH_BYTE(testParams.messageRunningCount);
  for (i = 3; i < testParams.payloadLength; i++) {
    messagePayload[i] = i - 3;
  }
  if (testParams.maxInFlight > 0
      && testParams.currentInFlight >= testParams.maxInFlight) {
    slxu_zigbee_event_set_delay_ms(throughputPacketSendEventControl, 1);
    return;
  }
  apsFrame.sourceEndpoint = 0xFF;
  apsFrame.destinationEndpoint = 0xFF;
  apsFrame.options = testParams.apsOptions;
  apsFrame.profileId = 0x7F01; // test profile ID
  apsFrame.clusterId = 0x0001; // counted packets cluster

  if (emAfSend(EMBER_OUTGOING_DIRECT,
               testParams.destination,
               &apsFrame,
               testParams.payloadLength,
               messagePayload,
               messageTag,
               0xFFFF,
               0) == EMBER_SUCCESS) {
    testParams.messageRunningCount++;
    testParams.currentInFlight++;

    for (i = 0; i < ZIGBEE_TX_TEST_MAX_INFLIGHT; i++) {
      if (!testParams.inflightInfoTable[i].inUse) {
        testParams.inflightInfoTable[i].inUse = true;
        testParams.inflightInfoTable[i].seqn = apsFrame.sequence;
        testParams.inflightInfoTable[i].startTime =
          halCommonGetInt32uMillisecondTick();
        break;
      }
    }
    assert(i < ZIGBEE_TX_TEST_MAX_INFLIGHT);
  }

  if (testParams.messageRunningCount
      >= testParams.messageTotalCount) {
    slxu_zigbee_event_set_inactive(throughputPacketSendEventControl);
    isRunning = 0;
  } else {
    // txIntervalAdjustment subtracts out time spent in this function from the send loop timer,
    // which makes a significant difference for host applications using ncp-uart
    txIntervalAdjustmentMs = elapsedTimeInt32u(currentTimeMs, halCommonGetInt32uMillisecondTick());
    if (txIntervalAdjustmentMs >= testParams.txIntervalMs) {
      adjustedTxIntervalMs = 0;
    } else {
      adjustedTxIntervalMs = testParams.txIntervalMs - txIntervalAdjustmentMs;
    }
    slxu_zigbee_event_set_delay_ms(throughputPacketSendEventControl,
                                   adjustedTxIntervalMs);
  }
}

#ifdef UC_BUILD

void emAfPluginThroughputCliPrintParameters(sl_cli_command_arg_t *arguments)
{
  (void)arguments;

  printAllParameters();
}

void emAfPluginThroughputCliSetAllParameters(sl_cli_command_arg_t *arguments)
{
  static uint8_t minPacketLen;

  testParams.destination = (uint16_t)emberUnsignedCommandArgument(0);
  testParams.messageTotalCount = (uint16_t)emberUnsignedCommandArgument(1);
  testParams.txIntervalMs = (uint16_t)emberUnsignedCommandArgument(2);
  testParams.packetLength = (uint8_t)emberUnsignedCommandArgument(3);
  testParams.maxInFlight = (uint8_t)emberUnsignedCommandArgument(4);
  testParams.apsOptions = (EmberApsOption)emberUnsignedCommandArgument(5);
  testParams.testTimeout = (uint32_t)emberUnsignedCommandArgument(6);

  // Check packet length parameter
  getHeaderLen();
  minPacketLen = testParams.headerLength + 4;
  if (testParams.packetLength < minPacketLen) {
    testParams.packetLength = minPacketLen;
  } else if (testParams.packetLength > MAX_PACKET_LENGTH) {
    testParams.packetLength = MAX_PACKET_LENGTH;
  }
  testParams.payloadLength = testParams.packetLength - testParams.headerLength;

  // Check in-flight parameter
  if (testParams.maxInFlight > ZIGBEE_TX_TEST_MAX_INFLIGHT) {
    testParams.maxInFlight = ZIGBEE_TX_TEST_MAX_INFLIGHT;
  } else if (testParams.maxInFlight <= 0) {
    testParams.maxInFlight = 1;
  }
  printAllParameters();
}

void emAfPluginThroughputCliSetDestination(sl_cli_command_arg_t *arguments)
{
  testParams.destination = (uint16_t)emberUnsignedCommandArgument(0);
  getHeaderLen();
  testParams.packetLength = testParams.payloadLength + testParams.headerLength;
  if (testParams.packetLength > MAX_PACKET_LENGTH) {
    testParams.payloadLength = MAX_PACKET_LENGTH - testParams.headerLength;
  }
  printParameter(DESTINATION);
  printParameter(PACKET);
}

void emAfPluginThroughputCliSetTestCount(sl_cli_command_arg_t *arguments)
{
  testParams.messageTotalCount = (uint16_t)emberUnsignedCommandArgument(0);
  printParameter(COUNT);
}

void emAfPluginThroughputCliSetInterval(sl_cli_command_arg_t *arguments)
{
  testParams.txIntervalMs = (uint16_t)emberUnsignedCommandArgument(0);
  printParameter(INTERVAL);
}

void emAfPluginThroughputCliSetPacketSize(sl_cli_command_arg_t *arguments)
{
  static uint8_t minPacketLen;

  testParams.packetLength = (uint8_t)emberUnsignedCommandArgument(0);
  getHeaderLen();
  minPacketLen = testParams.headerLength + 4;

  if (testParams.packetLength < minPacketLen) {
    testParams.packetLength = minPacketLen;
  } else if (testParams.packetLength > MAX_PACKET_LENGTH) {
    testParams.packetLength = MAX_PACKET_LENGTH;
  }
  testParams.payloadLength = testParams.packetLength - testParams.headerLength;

  emberAfCorePrintln("Max packet: 127");
  printParameter(HEADER);
  printParameter(PAYLOAD);
  printParameter(PACKET);
}

void emAfPluginThroughputCliSetInFlightCount(sl_cli_command_arg_t *arguments)
{
  testParams.maxInFlight = (uint8_t)emberUnsignedCommandArgument(0);
  if (testParams.maxInFlight > ZIGBEE_TX_TEST_MAX_INFLIGHT) {
    testParams.maxInFlight = ZIGBEE_TX_TEST_MAX_INFLIGHT;
  } else if (testParams.maxInFlight <= 0) {
    testParams.maxInFlight = 1;
  }
  printParameter(INFLIGHT);
}

void emAfPluginThroughputCliSetApsAckOn(sl_cli_command_arg_t *arguments)
{
  testParams.apsOptions |= EMBER_APS_OPTION_RETRY;
  printParameter(APSOPTIONS);
}

void emAfPluginThroughputCliSetApsAckOff(sl_cli_command_arg_t *arguments)
{
  testParams.apsOptions &= ~EMBER_APS_OPTION_RETRY;
  printParameter(APSOPTIONS);
}

void emAfPluginThroughputCliSetTestTimeout(sl_cli_command_arg_t *arguments)
{
  testParams.testTimeout = (uint32_t)emberUnsignedCommandArgument(0);
  printParameter(TESTTIMEOUT);
}

void emAfPluginThroughputCliClearCounters(sl_cli_command_arg_t *arguments)
{
  (void)arguments;

