espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/throughput/throughput.c
  clearCounters();
}

void emAfPluginThroughputCliStopTest(sl_cli_command_arg_t *arguments)
{
  (void)arguments;

  stopTest();
}

void emAfPluginThroughputCliStartTest(sl_cli_command_arg_t *arguments)
{
  (void)arguments;

  startTest();
}

void emAfPluginThroughputCliPrintResult(sl_cli_command_arg_t *arguments)
{
  (void) arguments;

  printResult();
}

void emAfPluginThroughputCliPrintCounters(sl_cli_command_arg_t *arguments)
{
  #ifdef EZSP_HOST
  ezspReadCounters(emberCounters);
  #endif // EZSP_HOST
  emberAfCorePrintln(" ");
  emberAfCorePrintln("COUNTERS");
  printCounter(EMBER_COUNTER_PHY_CCA_FAIL_COUNT);
  printCounter(EMBER_COUNTER_MAC_TX_UNICAST_SUCCESS);
  printCounter(EMBER_COUNTER_MAC_TX_UNICAST_RETRY);
  printCounter(EMBER_COUNTER_MAC_TX_UNICAST_FAILED);
  printCounter(EMBER_COUNTER_APS_DATA_TX_UNICAST_SUCCESS);
  printCounter(EMBER_COUNTER_APS_DATA_TX_UNICAST_RETRY);
  printCounter(EMBER_COUNTER_APS_DATA_TX_UNICAST_FAILED);
}
#else //UC_BUILD

void emAfPluginThroughputCliPrintParameters(void)
{
  printAllParameters();
}

void emAfPluginThroughputCliSetAllParameters(void)
{
  static uint8_t minPacketLen;

  testParams.destination = (uint16_t)emberUnsignedCommandArgument(0);
  testParams.messageTotalCount = (uint16_t)emberUnsignedCommandArgument(1);
  testParams.txIntervalMs = (uint16_t)emberUnsignedCommandArgument(2);
  testParams.packetLength = (uint8_t)emberUnsignedCommandArgument(3);
  testParams.maxInFlight = (uint8_t)emberUnsignedCommandArgument(4);
  testParams.apsOptions = (EmberApsOption)emberUnsignedCommandArgument(5);
  testParams.testTimeout = (uint32_t)emberUnsignedCommandArgument(6);

  // Check packet length parameter
  getHeaderLen();
  minPacketLen = testParams.headerLength + 4;
  if (testParams.packetLength < minPacketLen) {
    testParams.packetLength = minPacketLen;
  } else if (testParams.packetLength > MAX_PACKET_LENGTH) {
    testParams.packetLength = MAX_PACKET_LENGTH;
  }
  testParams.payloadLength = testParams.packetLength - testParams.headerLength;

  // Check in-flight parameter
  if (testParams.maxInFlight > ZIGBEE_TX_TEST_MAX_INFLIGHT) {
    testParams.maxInFlight = ZIGBEE_TX_TEST_MAX_INFLIGHT;
  } else if (testParams.maxInFlight <= 0) {
    testParams.maxInFlight = 1;
  }
  printAllParameters();
}

void emAfPluginThroughputCliSetDestination(void)
{
  testParams.destination = (uint16_t)emberUnsignedCommandArgument(0);
  getHeaderLen();
  testParams.packetLength = testParams.payloadLength + testParams.headerLength;
  if (testParams.packetLength > MAX_PACKET_LENGTH) {
    testParams.payloadLength = MAX_PACKET_LENGTH - testParams.headerLength;
  }
  printParameter(DESTINATION);
  printParameter(PACKET);
}

void emAfPluginThroughputCliSetTestCount(void)
{
  testParams.messageTotalCount = (uint16_t)emberUnsignedCommandArgument(0);
  printParameter(COUNT);
}

void emAfPluginThroughputCliSetInterval(void)
{
  testParams.txIntervalMs = (uint16_t)emberUnsignedCommandArgument(0);
  printParameter(INTERVAL);
}

void emAfPluginThroughputCliSetPacketSize(void)
{
  static uint8_t minPacketLen;

  testParams.packetLength = (uint8_t)emberUnsignedCommandArgument(0);
  getHeaderLen();
  minPacketLen = testParams.headerLength + 4;

  if (testParams.packetLength < minPacketLen) {
    testParams.packetLength = minPacketLen;
  } else if (testParams.packetLength > MAX_PACKET_LENGTH) {
    testParams.packetLength = MAX_PACKET_LENGTH;
  }
  testParams.payloadLength = testParams.packetLength - testParams.headerLength;

  emberAfCorePrintln("Max packet: 127");
  printParameter(HEADER);
  printParameter(PAYLOAD);
  printParameter(PACKET);
}

void emAfPluginThroughputCliSetInFlightCount(void)
{
  testParams.maxInFlight = (uint8_t)emberUnsignedCommandArgument(0);
  if (testParams.maxInFlight > ZIGBEE_TX_TEST_MAX_INFLIGHT) {
    testParams.maxInFlight = ZIGBEE_TX_TEST_MAX_INFLIGHT;
  } else if (testParams.maxInFlight <= 0) {
    testParams.maxInFlight = 1;
  }
  printParameter(INFLIGHT);
}

void emAfPluginThroughputCliSetApsAckOn(void)
{
  testParams.apsOptions |= EMBER_APS_OPTION_RETRY;
  printParameter(APSOPTIONS);
}

void emAfPluginThroughputCliSetApsAckOff(void)
{
  testParams.apsOptions &= ~EMBER_APS_OPTION_RETRY;
  printParameter(APSOPTIONS);
}

void emAfPluginThroughputCliSetTestTimeout(void)
{
  testParams.testTimeout = (uint32_t)emberUnsignedCommandArgument(0);
  printParameter(TESTTIMEOUT);
}

void emAfPluginThroughputCliClearCounters(void)
{
  clearCounters();
}

void emAfPluginThroughputCliStopTest(void)
{
  stopTest();
}

void emAfPluginThroughputCliStartTest(void)
{
  startTest();
}

void emAfPluginThroughputCliPrintResult(void)
{
  printResult();
}

void emAfPluginThroughputCliPrintCounters(void)
{
  #ifdef EZSP_HOST
  ezspReadCounters(emberCounters);
  #endif // EZSP_HOST
  emberAfCorePrintln(" ");
  emberAfCorePrintln("COUNTERS");
  printCounter(EMBER_COUNTER_PHY_CCA_FAIL_COUNT);
  printCounter(EMBER_COUNTER_MAC_TX_UNICAST_SUCCESS);
  printCounter(EMBER_COUNTER_MAC_TX_UNICAST_RETRY);
  printCounter(EMBER_COUNTER_MAC_TX_UNICAST_FAILED);
  printCounter(EMBER_COUNTER_APS_DATA_TX_UNICAST_SUCCESS);
  printCounter(EMBER_COUNTER_APS_DATA_TX_UNICAST_RETRY);
  printCounter(EMBER_COUNTER_APS_DATA_TX_UNICAST_FAILED);
}
#endif //UC_BUILD
